In [250]:
import pandas as pd
import numpy as np
data = {"state": ["Ohio", "Ohio", "Ohio", "Nevada", "Nevada", "Nevada"],
        "year": [2000, 2001, 2002, 2001, 2002, 2003],
        "pop": [1.5, 1.7, 3.6, 2.4, 2.9, 3.2], "hej":"hej"}
df1 = pd.DataFrame(data)
df1

    state  year  pop  hej
0    Ohio  2000  1.5  hej
1    Ohio  2001  1.7  hej
2    Ohio  2002  3.6  hej
3  Nevada  2001  2.4  hej
4  Nevada  2002  2.9  hej
5  Nevada  2003  3.2  hej

In [72]:
df1["state"]

0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
5    Nevada
Name: state, dtype: object

In [73]:
df1[1:2]["state"]

1    Ohio
Name: state, dtype: object

In [224]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),index=["Ohio", "Colorado", "Utah", "New York"], columns=["one", "two", "three", "four"])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [49]:
df1[df1['pop']==2.4]

    state  year  pop
3  Nevada  2001  2.4

In [106]:
obj1 = pd.Series([1, 2, 3])
obj2 = pd.Series([1, 2, 3], index=["a", "b", "c"])

In [173]:
obj1.loc[obj1<3]

0    1
1    2
dtype: int64